import { render } from "./template.js";

const username = 'Peter';
const items = [
    'Product 1',
    'Product 2',
    'Product 3'
];
const ctx = {
    username,
    items
}
    //за да вдигнем абстракцията и да избегнем кода на ниско ниво долу
    //вкарваме променливите горе в обект като чрез регекс-а търсим съвпадения 
    //и ако има ги заместваме с стойностите на полето от този обект, затова и маркера и полето са 
    //с едни и същи имена и изнасяме функцията render в нов файл template където тя ще служи само 
    //само за да прави темплайти за визуализиране
//let result = html.replace('%%username%%', ctx['username']);
    //това го правим за да може динамично да подаваме логнатия потребител 
    //който в момента съм хардкоднал, но при реално приложени ще взимаме кой 
    //е логнат и ще подаваме неговото име
//result = result.replace('%%items%%', ctx['items'].map(i => `<li>${i}</li>`).join('\n'));
    //същото правим и за темите само че в Catalog Page,
    //като replace функцията ще замести само ако го има маркера който сме посочили

const views = {
    'home-link': 'home',
    'catalog-link': 'catalog',
    'about-link': 'about'
};
    //правим си асосиативен масив в който пазим ид-та на елементите в навигацията
    //и HTML-a им или тяхното view, те не трябва да са тук, правим си папка Views 
    //и в отелни HTML-ли слагаме view-то за всеки елемент.


document.querySelector('nav').addEventListener('click', (event) =>{
    if (event.target.tagName == 'A'){
        const view = views[event.target.id];
        if (view !== undefined){
            render(view, ctx);
        }
    }
});
    //взимам nav секцията от HTML-a , слагам листенер за клик, проверявам дали е кликнато 
    //върху правилния елемент, ако е взимам ид-то на елемента върху който е кликнато и 
    // спрямо него от масива горе изваждам html-a отговарящ на това ид
    //, след проверявам дали view-то съществува-ако ид-то го има в масива html-a няма да е undefined
    //и ако го има го подавам на функцията долу , която взима main елемента и замества innerHTML-а му
    //със html-a който сме извадили от масива спрямо натиснатото поле

